# Importar módulos
import pulp as lp
# -----------------
# Conjuntos
# -----------------
# OPERACIONES
I =["20241204 OP-68",	"20241204 OP-57",	"20241204 OP-133",	"20241204 OP-12",	"20241204 OP-159",	"20241204 OP-18",	"20241204 OP-67",	"20241204 OP-2",	"20241204 OP-138",	"20241204 OP-5",	"20241204 OP-44",	"20241204 OP-107",	"20241204 OP-88",
]
# QUIROFANOS
J=["Quirófano 1",
"Quirófano 2",
"Quirófano 3",
"Quirófano 4",
"Quirófano 5",
"Quirófano 6",
"Quirófano 7",
"Quirófano 8",
"Quirófano 9",
"Quirófano 10",
"Quirófano 11",
"Quirófano 12",
"Quirófano 13",
"Quirófano 14",
"Quirófano 15",
"Quirófano 16",
"Quirófano 17",
"Quirófano 18",
"Quirófano 19",
"Quirófano 20",
"Quirófano 21",
"Quirófano 22",
"Quirófano 23",
"Quirófano 24",
"Quirófano 25",
"Quirófano 26",
"Quirófano 27",
"Quirófano 28",
"Quirófano 29",
"Quirófano 30",
"Quirófano 31",
"Quirófano 32",
"Quirófano 33",
"Quirófano 34",
"Quirófano 35",
"Quirófano 36",
"Quirófano 37",
"Quirófano 38",
"Quirófano 39",
"Quirófano 40",
"Quirófano 41",
"Quirófano 42",
"Quirófano 43",
"Quirófano 44",
"Quirófano 45",
"Quirófano 46",
"Quirófano 47",
"Quirófano 48",
"Quirófano 49",
"Quirófano 50",
"Quirófano 51",
"Quirófano 52",
"Quirófano 53",
"Quirófano 54",
"Quirófano 55",
"Quirófano 56",
"Quirófano 57",
"Quirófano 58",
"Quirófano 59",
"Quirófano 60",
"Quirófano 61",
"Quirófano 62",
"Quirófano 63",
"Quirófano 64",
"Quirófano 65",
"Quirófano 66",
"Quirófano 67",
"Quirófano 68",
"Quirófano 69",
"Quirófano 70",
"Quirófano 71",
"Quirófano 72",
"Quirófano 73",
"Quirófano 74",
"Quirófano 75",
"Quirófano 76",
"Quirófano 77",
"Quirófano 78",
"Quirófano 79",
"Quirófano 80",
"Quirófano 81",
"Quirófano 82",
"Quirófano 83",
"Quirófano 84",
"Quirófano 85",
"Quirófano 86",
"Quirófano 87",
"Quirófano 88",
"Quirófano 89",
"Quirófano 90",
"Quirófano 91",
"Quirófano 92",
"Quirófano 93",
"Quirófano 94",
"Quirófano 95",
"Quirófano 96",
"Quirófano 97",
"Quirófano 98",
"Quirófano 99",
]

# -----------------
# Subconjuntos
# -----------------
#OPERACIONES INCOMPATIBLES

L = {"20241204 OP-68":("20241204 OP-133","20241204 OP-159","20241204 OP-2","20241204 OP-44","20241204 OP-107","20241204 OP-88",),
"20241204 OP-57":("20241204 OP-138",),
"20241204 OP-133":("20241204 OP-68","20241204 OP-159","20241204 OP-2","20241204 OP-44","20241204 OP-107","20241204 OP-88",),
"20241204 OP-12":("20241204 OP-159",),
"20241204 OP-159":("20241204 OP-68","20241204 OP-133","20241204 OP-12","20241204 OP-44","20241204 OP-107","20241204 OP-88",),
"20241204 OP-18":("20241204 OP-88",),
"20241204 OP-67":("20241204 OP-2","20241204 OP-88",),
"20241204 OP-2":("20241204 OP-68","20241204 OP-133","20241204 OP-67","20241204 OP-44","20241204 OP-107","20241204 OP-88",),
"20241204 OP-138":("20241204 OP-57",),
"20241204 OP-5":(),
"20241204 OP-44":("20241204 OP-68","20241204 OP-133","20241204 OP-159","20241204 OP-2","20241204 OP-107","20241204 OP-88",),
"20241204 OP-107":("20241204 OP-68","20241204 OP-133","20241204 OP-159","20241204 OP-2","20241204 OP-44","20241204 OP-88",),
"20241204 OP-88":("20241204 OP-68","20241204 OP-133","20241204 OP-159","20241204 OP-18","20241204 OP-67","20241204 OP-2","20241204 OP-44","20241204 OP-107",),}


# -----------------
# Parametros
# -----------------

c={("20241204 OP-68","Quirófano 1"):284,	("20241204 OP-57","Quirófano 1"):813,	("20241204 OP-133","Quirófano 1"):653,	("20241204 OP-12","Quirófano 1"):568,	("20241204 OP-159","Quirófano 1"):2861,	("20241204 OP-18","Quirófano 1"):1361,	("20241204 OP-67","Quirófano 1"):116,	("20241204 OP-2","Quirófano 1"):296,	("20241204 OP-138","Quirófano 1"):1741,	("20241204 OP-5","Quirófano 1"):2877,	("20241204 OP-44","Quirófano 1"):449,	("20241204 OP-107","Quirófano 1"):1646,	("20241204 OP-88","Quirófano 1"):742,
("20241204 OP-68","Quirófano 2"):596,	("20241204 OP-57","Quirófano 2"):3876,	("20241204 OP-133","Quirófano 2"):134,	("20241204 OP-12","Quirófano 2"):991,	("20241204 OP-159","Quirófano 2"):1606,	("20241204 OP-18","Quirófano 2"):871,	("20241204 OP-67","Quirófano 2"):125,	("20241204 OP-2","Quirófano 2"):898,	("20241204 OP-138","Quirófano 2"):1647,	("20241204 OP-5","Quirófano 2"):401,	("20241204 OP-44","Quirófano 2"):455,	("20241204 OP-107","Quirófano 2"):287,	("20241204 OP-88","Quirófano 2"):210,
("20241204 OP-68","Quirófano 3"):137,	("20241204 OP-57","Quirófano 3"):3902,	("20241204 OP-133","Quirófano 3"):497,	("20241204 OP-12","Quirófano 3"):407,	("20241204 OP-159","Quirófano 3"):3950,	("20241204 OP-18","Quirófano 3"):2169,	("20241204 OP-67","Quirófano 3"):856,	("20241204 OP-2","Quirófano 3"):737,	("20241204 OP-138","Quirófano 3"):658,	("20241204 OP-5","Quirófano 3"):1402,	("20241204 OP-44","Quirófano 3"):167,	("20241204 OP-107","Quirófano 3"):589,	("20241204 OP-88","Quirófano 3"):866,
("20241204 OP-68","Quirófano 4"):298,	("20241204 OP-57","Quirófano 4"):797,	("20241204 OP-133","Quirófano 4"):245,	("20241204 OP-12","Quirófano 4"):2004,	("20241204 OP-159","Quirófano 4"):1677,	("20241204 OP-18","Quirófano 4"):637,	("20241204 OP-67","Quirófano 4"):858,	("20241204 OP-2","Quirófano 4"):176,	("20241204 OP-138","Quirófano 4"):114,	("20241204 OP-5","Quirófano 4"):606,	("20241204 OP-44","Quirófano 4"):629,	("20241204 OP-107","Quirófano 4"):1999,	("20241204 OP-88","Quirófano 4"):557,
("20241204 OP-68","Quirófano 5"):409,	("20241204 OP-57","Quirófano 5"):216,	("20241204 OP-133","Quirófano 5"):505,	("20241204 OP-12","Quirófano 5"):3874,	("20241204 OP-159","Quirófano 5"):2186,	("20241204 OP-18","Quirófano 5"):2287,	("20241204 OP-67","Quirófano 5"):627,	("20241204 OP-2","Quirófano 5"):423,	("20241204 OP-138","Quirófano 5"):1281,	("20241204 OP-5","Quirófano 5"):357,	("20241204 OP-44","Quirófano 5"):732,	("20241204 OP-107","Quirófano 5"):1320,	("20241204 OP-88","Quirófano 5"):387,
("20241204 OP-68","Quirófano 6"):394,	("20241204 OP-57","Quirófano 6"):3266,	("20241204 OP-133","Quirófano 6"):345,	("20241204 OP-12","Quirófano 6"):1090,	("20241204 OP-159","Quirófano 6"):2373,	("20241204 OP-18","Quirófano 6"):2101,	("20241204 OP-67","Quirófano 6"):442,	("20241204 OP-2","Quirófano 6"):846,	("20241204 OP-138","Quirófano 6"):1622,	("20241204 OP-5","Quirófano 6"):2962,	("20241204 OP-44","Quirófano 6"):766,	("20241204 OP-107","Quirófano 6"):925,	("20241204 OP-88","Quirófano 6"):111,
("20241204 OP-68","Quirófano 7"):719,	("20241204 OP-57","Quirófano 7"):815,	("20241204 OP-133","Quirófano 7"):419,	("20241204 OP-12","Quirófano 7"):1439,	("20241204 OP-159","Quirófano 7"):2527,	("20241204 OP-18","Quirófano 7"):1831,	("20241204 OP-67","Quirófano 7"):691,	("20241204 OP-2","Quirófano 7"):336,	("20241204 OP-138","Quirófano 7"):1767,	("20241204 OP-5","Quirófano 7"):2780,	("20241204 OP-44","Quirófano 7"):480,	("20241204 OP-107","Quirófano 7"):1273,	("20241204 OP-88","Quirófano 7"):389,
("20241204 OP-68","Quirófano 8"):607,	("20241204 OP-57","Quirófano 8"):896,	("20241204 OP-133","Quirófano 8"):793,	("20241204 OP-12","Quirófano 8"):2825,	("20241204 OP-159","Quirófano 8"):168,	("20241204 OP-18","Quirófano 8"):224,	("20241204 OP-67","Quirófano 8"):399,	("20241204 OP-2","Quirófano 8"):842,	("20241204 OP-138","Quirófano 8"):281,	("20241204 OP-5","Quirófano 8"):2270,	("20241204 OP-44","Quirófano 8"):491,	("20241204 OP-107","Quirófano 8"):210,	("20241204 OP-88","Quirófano 8"):887,
("20241204 OP-68","Quirófano 9"):591,	("20241204 OP-57","Quirófano 9"):2948,	("20241204 OP-133","Quirófano 9"):294,	("20241204 OP-12","Quirófano 9"):1087,	("20241204 OP-159","Quirófano 9"):3843,	("20241204 OP-18","Quirófano 9"):559,	("20241204 OP-67","Quirófano 9"):668,	("20241204 OP-2","Quirófano 9"):717,	("20241204 OP-138","Quirófano 9"):1732,	("20241204 OP-5","Quirófano 9"):2194,	("20241204 OP-44","Quirófano 9"):137,	("20241204 OP-107","Quirófano 9"):680,	("20241204 OP-88","Quirófano 9"):899,
("20241204 OP-68","Quirófano 10"):806,	("20241204 OP-57","Quirófano 10"):215,	("20241204 OP-133","Quirófano 10"):216,	("20241204 OP-12","Quirófano 10"):3878,	("20241204 OP-159","Quirófano 10"):3048,	("20241204 OP-18","Quirófano 10"):1901,	("20241204 OP-67","Quirófano 10"):544,	("20241204 OP-2","Quirófano 10"):746,	("20241204 OP-138","Quirófano 10"):1398,	("20241204 OP-5","Quirófano 10"):1450,	("20241204 OP-44","Quirófano 10"):368,	("20241204 OP-107","Quirófano 10"):719,	("20241204 OP-88","Quirófano 10"):305,
("20241204 OP-68","Quirófano 11"):201,	("20241204 OP-57","Quirófano 11"):107,	("20241204 OP-133","Quirófano 11"):873,	("20241204 OP-12","Quirófano 11"):1549,	("20241204 OP-159","Quirófano 11"):226,	("20241204 OP-18","Quirófano 11"):2322,	("20241204 OP-67","Quirófano 11"):374,	("20241204 OP-2","Quirófano 11"):444,	("20241204 OP-138","Quirófano 11"):1158,	("20241204 OP-5","Quirófano 11"):229,	("20241204 OP-44","Quirófano 11"):681,	("20241204 OP-107","Quirófano 11"):1893,	("20241204 OP-88","Quirófano 11"):258,
("20241204 OP-68","Quirófano 12"):590,	("20241204 OP-57","Quirófano 12"):3440,	("20241204 OP-133","Quirófano 12"):244,	("20241204 OP-12","Quirófano 12"):818,	("20241204 OP-159","Quirófano 12"):2542,	("20241204 OP-18","Quirófano 12"):2228,	("20241204 OP-67","Quirófano 12"):528,	("20241204 OP-2","Quirófano 12"):272,	("20241204 OP-138","Quirófano 12"):943,	("20241204 OP-5","Quirófano 12"):2107,	("20241204 OP-44","Quirófano 12"):792,	("20241204 OP-107","Quirófano 12"):736,	("20241204 OP-88","Quirófano 12"):897,
("20241204 OP-68","Quirófano 13"):356,	("20241204 OP-57","Quirófano 13"):3374,	("20241204 OP-133","Quirófano 13"):333,	("20241204 OP-12","Quirófano 13"):1025,	("20241204 OP-159","Quirófano 13"):2097,	("20241204 OP-18","Quirófano 13"):1948,	("20241204 OP-67","Quirófano 13"):106,	("20241204 OP-2","Quirófano 13"):737,	("20241204 OP-138","Quirófano 13"):625,	("20241204 OP-5","Quirófano 13"):2652,	("20241204 OP-44","Quirófano 13"):651,	("20241204 OP-107","Quirófano 13"):154,	("20241204 OP-88","Quirófano 13"):404,
("20241204 OP-68","Quirófano 14"):709,	("20241204 OP-57","Quirófano 14"):3920,	("20241204 OP-133","Quirófano 14"):176,	("20241204 OP-12","Quirófano 14"):3499,	("20241204 OP-159","Quirófano 14"):312,	("20241204 OP-18","Quirófano 14"):1826,	("20241204 OP-67","Quirófano 14"):695,	("20241204 OP-2","Quirófano 14"):613,	("20241204 OP-138","Quirófano 14"):974,	("20241204 OP-5","Quirófano 14"):961,	("20241204 OP-44","Quirófano 14"):472,	("20241204 OP-107","Quirófano 14"):212,	("20241204 OP-88","Quirófano 14"):821,
("20241204 OP-68","Quirófano 15"):585,	("20241204 OP-57","Quirófano 15"):3385,	("20241204 OP-133","Quirófano 15"):576,	("20241204 OP-12","Quirófano 15"):1624,	("20241204 OP-159","Quirófano 15"):1606,	("20241204 OP-18","Quirófano 15"):2460,	("20241204 OP-67","Quirófano 15"):274,	("20241204 OP-2","Quirófano 15"):721,	("20241204 OP-138","Quirófano 15"):869,	("20241204 OP-5","Quirófano 15"):956,	("20241204 OP-44","Quirófano 15"):644,	("20241204 OP-107","Quirófano 15"):1912,	("20241204 OP-88","Quirófano 15"):141,
("20241204 OP-68","Quirófano 16"):198,	("20241204 OP-57","Quirófano 16"):2718,	("20241204 OP-133","Quirófano 16"):865,	("20241204 OP-12","Quirófano 16"):2246,	("20241204 OP-159","Quirófano 16"):3161,	("20241204 OP-18","Quirófano 16"):120,	("20241204 OP-67","Quirófano 16"):880,	("20241204 OP-2","Quirófano 16"):886,	("20241204 OP-138","Quirófano 16"):859,	("20241204 OP-5","Quirófano 16"):1836,	("20241204 OP-44","Quirófano 16"):781,	("20241204 OP-107","Quirófano 16"):910,	("20241204 OP-88","Quirófano 16"):691,
("20241204 OP-68","Quirófano 17"):649,	("20241204 OP-57","Quirófano 17"):3452,	("20241204 OP-133","Quirófano 17"):405,	("20241204 OP-12","Quirófano 17"):3125,	("20241204 OP-159","Quirófano 17"):1076,	("20241204 OP-18","Quirófano 17"):1477,	("20241204 OP-67","Quirófano 17"):322,	("20241204 OP-2","Quirófano 17"):565,	("20241204 OP-138","Quirófano 17"):1688,	("20241204 OP-5","Quirófano 17"):1606,	("20241204 OP-44","Quirófano 17"):117,	("20241204 OP-107","Quirófano 17"):1395,	("20241204 OP-88","Quirófano 17"):592,
("20241204 OP-68","Quirófano 18"):869,	("20241204 OP-57","Quirófano 18"):2444,	("20241204 OP-133","Quirófano 18"):429,	("20241204 OP-12","Quirófano 18"):2508,	("20241204 OP-159","Quirófano 18"):564,	("20241204 OP-18","Quirófano 18"):1403,	("20241204 OP-67","Quirófano 18"):551,	("20241204 OP-2","Quirófano 18"):873,	("20241204 OP-138","Quirófano 18"):1037,	("20241204 OP-5","Quirófano 18"):141,	("20241204 OP-44","Quirófano 18"):548,	("20241204 OP-107","Quirófano 18"):941,	("20241204 OP-88","Quirófano 18"):178,
("20241204 OP-68","Quirófano 19"):761,	("20241204 OP-57","Quirófano 19"):1594,	("20241204 OP-133","Quirófano 19"):444,	("20241204 OP-12","Quirófano 19"):2298,	("20241204 OP-159","Quirófano 19"):516,	("20241204 OP-18","Quirófano 19"):744,	("20241204 OP-67","Quirófano 19"):850,	("20241204 OP-2","Quirófano 19"):653,	("20241204 OP-138","Quirófano 19"):1735,	("20241204 OP-5","Quirófano 19"):2691,	("20241204 OP-44","Quirófano 19"):742,	("20241204 OP-107","Quirófano 19"):1681,	("20241204 OP-88","Quirófano 19"):142,
("20241204 OP-68","Quirófano 20"):561,	("20241204 OP-57","Quirófano 20"):3716,	("20241204 OP-133","Quirófano 20"):724,	("20241204 OP-12","Quirófano 20"):1942,	("20241204 OP-159","Quirófano 20"):664,	("20241204 OP-18","Quirófano 20"):1350,	("20241204 OP-67","Quirófano 20"):239,	("20241204 OP-2","Quirófano 20"):131,	("20241204 OP-138","Quirófano 20"):855,	("20241204 OP-5","Quirófano 20"):519,	("20241204 OP-44","Quirófano 20"):775,	("20241204 OP-107","Quirófano 20"):978,	("20241204 OP-88","Quirófano 20"):340,
("20241204 OP-68","Quirófano 21"):369,	("20241204 OP-57","Quirófano 21"):246,	("20241204 OP-133","Quirófano 21"):457,	("20241204 OP-12","Quirófano 21"):2976,	("20241204 OP-159","Quirófano 21"):526,	("20241204 OP-18","Quirófano 21"):1923,	("20241204 OP-67","Quirófano 21"):327,	("20241204 OP-2","Quirófano 21"):543,	("20241204 OP-138","Quirófano 21"):1125,	("20241204 OP-5","Quirófano 21"):2577,	("20241204 OP-44","Quirófano 21"):102,	("20241204 OP-107","Quirófano 21"):204,	("20241204 OP-88","Quirófano 21"):241,
("20241204 OP-68","Quirófano 22"):830,	("20241204 OP-57","Quirófano 22"):2977,	("20241204 OP-133","Quirófano 22"):552,	("20241204 OP-12","Quirófano 22"):3384,	("20241204 OP-159","Quirófano 22"):3651,	("20241204 OP-18","Quirófano 22"):1781,	("20241204 OP-67","Quirófano 22"):842,	("20241204 OP-2","Quirófano 22"):171,	("20241204 OP-138","Quirófano 22"):261,	("20241204 OP-5","Quirófano 22"):1631,	("20241204 OP-44","Quirófano 22"):525,	("20241204 OP-107","Quirófano 22"):1938,	("20241204 OP-88","Quirófano 22"):689,
("20241204 OP-68","Quirófano 23"):769,	("20241204 OP-57","Quirófano 23"):1067,	("20241204 OP-133","Quirófano 23"):103,	("20241204 OP-12","Quirófano 23"):2340,	("20241204 OP-159","Quirófano 23"):2475,	("20241204 OP-18","Quirófano 23"):1249,	("20241204 OP-67","Quirófano 23"):601,	("20241204 OP-2","Quirófano 23"):799,	("20241204 OP-138","Quirófano 23"):1789,	("20241204 OP-5","Quirófano 23"):1674,	("20241204 OP-44","Quirófano 23"):805,	("20241204 OP-107","Quirófano 23"):1157,	("20241204 OP-88","Quirófano 23"):604,
("20241204 OP-68","Quirófano 24"):493,	("20241204 OP-57","Quirófano 24"):506,	("20241204 OP-133","Quirófano 24"):533,	("20241204 OP-12","Quirófano 24"):2899,	("20241204 OP-159","Quirófano 24"):3891,	("20241204 OP-18","Quirófano 24"):726,	("20241204 OP-67","Quirófano 24"):850,	("20241204 OP-2","Quirófano 24"):756,	("20241204 OP-138","Quirófano 24"):436,	("20241204 OP-5","Quirófano 24"):120,	("20241204 OP-44","Quirófano 24"):876,	("20241204 OP-107","Quirófano 24"):793,	("20241204 OP-88","Quirófano 24"):142,
("20241204 OP-68","Quirófano 25"):136,	("20241204 OP-57","Quirófano 25"):2754,	("20241204 OP-133","Quirófano 25"):557,	("20241204 OP-12","Quirófano 25"):3571,	("20241204 OP-159","Quirófano 25"):2990,	("20241204 OP-18","Quirófano 25"):514,	("20241204 OP-67","Quirófano 25"):895,	("20241204 OP-2","Quirófano 25"):307,	("20241204 OP-138","Quirófano 25"):1464,	("20241204 OP-5","Quirófano 25"):2986,	("20241204 OP-44","Quirófano 25"):581,	("20241204 OP-107","Quirófano 25"):237,	("20241204 OP-88","Quirófano 25"):503,
("20241204 OP-68","Quirófano 26"):403,	("20241204 OP-57","Quirófano 26"):2196,	("20241204 OP-133","Quirófano 26"):367,	("20241204 OP-12","Quirófano 26"):867,	("20241204 OP-159","Quirófano 26"):1659,	("20241204 OP-18","Quirófano 26"):2082,	("20241204 OP-67","Quirófano 26"):491,	("20241204 OP-2","Quirófano 26"):210,	("20241204 OP-138","Quirófano 26"):1323,	("20241204 OP-5","Quirófano 26"):1007,	("20241204 OP-44","Quirófano 26"):297,	("20241204 OP-107","Quirófano 26"):1732,	("20241204 OP-88","Quirófano 26"):200,
("20241204 OP-68","Quirófano 27"):325,	("20241204 OP-57","Quirófano 27"):403,	("20241204 OP-133","Quirófano 27"):660,	("20241204 OP-12","Quirófano 27"):708,	("20241204 OP-159","Quirófano 27"):1060,	("20241204 OP-18","Quirófano 27"):422,	("20241204 OP-67","Quirófano 27"):369,	("20241204 OP-2","Quirófano 27"):113,	("20241204 OP-138","Quirófano 27"):310,	("20241204 OP-5","Quirófano 27"):2243,	("20241204 OP-44","Quirófano 27"):264,	("20241204 OP-107","Quirófano 27"):546,	("20241204 OP-88","Quirófano 27"):711,
("20241204 OP-68","Quirófano 28"):377,	("20241204 OP-57","Quirófano 28"):1598,	("20241204 OP-133","Quirófano 28"):569,	("20241204 OP-12","Quirófano 28"):453,	("20241204 OP-159","Quirófano 28"):3131,	("20241204 OP-18","Quirófano 28"):1211,	("20241204 OP-67","Quirófano 28"):406,	("20241204 OP-2","Quirófano 28"):181,	("20241204 OP-138","Quirófano 28"):1328,	("20241204 OP-5","Quirófano 28"):950,	("20241204 OP-44","Quirófano 28"):308,	("20241204 OP-107","Quirófano 28"):289,	("20241204 OP-88","Quirófano 28"):407,
("20241204 OP-68","Quirófano 29"):690,	("20241204 OP-57","Quirófano 29"):183,	("20241204 OP-133","Quirófano 29"):705,	("20241204 OP-12","Quirófano 29"):1546,	("20241204 OP-159","Quirófano 29"):394,	("20241204 OP-18","Quirófano 29"):1275,	("20241204 OP-67","Quirófano 29"):278,	("20241204 OP-2","Quirófano 29"):895,	("20241204 OP-138","Quirófano 29"):1951,	("20241204 OP-5","Quirófano 29"):2185,	("20241204 OP-44","Quirófano 29"):779,	("20241204 OP-107","Quirófano 29"):1440,	("20241204 OP-88","Quirófano 29"):378,
("20241204 OP-68","Quirófano 30"):121,	("20241204 OP-57","Quirófano 30"):684,	("20241204 OP-133","Quirófano 30"):898,	("20241204 OP-12","Quirófano 30"):3323,	("20241204 OP-159","Quirófano 30"):2091,	("20241204 OP-18","Quirófano 30"):1488,	("20241204 OP-67","Quirófano 30"):510,	("20241204 OP-2","Quirófano 30"):607,	("20241204 OP-138","Quirófano 30"):1838,	("20241204 OP-5","Quirófano 30"):1406,	("20241204 OP-44","Quirófano 30"):231,	("20241204 OP-107","Quirófano 30"):1702,	("20241204 OP-88","Quirófano 30"):592,
("20241204 OP-68","Quirófano 31"):518,	("20241204 OP-57","Quirófano 31"):965,	("20241204 OP-133","Quirófano 31"):128,	("20241204 OP-12","Quirófano 31"):3542,	("20241204 OP-159","Quirófano 31"):3810,	("20241204 OP-18","Quirófano 31"):705,	("20241204 OP-67","Quirófano 31"):846,	("20241204 OP-2","Quirófano 31"):229,	("20241204 OP-138","Quirófano 31"):1941,	("20241204 OP-5","Quirófano 31"):2341,	("20241204 OP-44","Quirófano 31"):595,	("20241204 OP-107","Quirófano 31"):608,	("20241204 OP-88","Quirófano 31"):589,
("20241204 OP-68","Quirófano 32"):141,	("20241204 OP-57","Quirófano 32"):2464,	("20241204 OP-133","Quirófano 32"):787,	("20241204 OP-12","Quirófano 32"):3357,	("20241204 OP-159","Quirófano 32"):2931,	("20241204 OP-18","Quirófano 32"):1615,	("20241204 OP-67","Quirófano 32"):406,	("20241204 OP-2","Quirófano 32"):634,	("20241204 OP-138","Quirófano 32"):1984,	("20241204 OP-5","Quirófano 32"):2392,	("20241204 OP-44","Quirófano 32"):234,	("20241204 OP-107","Quirófano 32"):837,	("20241204 OP-88","Quirófano 32"):574,
("20241204 OP-68","Quirófano 33"):404,	("20241204 OP-57","Quirófano 33"):2994,	("20241204 OP-133","Quirófano 33"):631,	("20241204 OP-12","Quirófano 33"):2675,	("20241204 OP-159","Quirófano 33"):2613,	("20241204 OP-18","Quirófano 33"):1047,	("20241204 OP-67","Quirófano 33"):449,	("20241204 OP-2","Quirófano 33"):739,	("20241204 OP-138","Quirófano 33"):601,	("20241204 OP-5","Quirófano 33"):437,	("20241204 OP-44","Quirófano 33"):585,	("20241204 OP-107","Quirófano 33"):1289,	("20241204 OP-88","Quirófano 33"):330,
("20241204 OP-68","Quirófano 34"):108,	("20241204 OP-57","Quirófano 34"):165,	("20241204 OP-133","Quirófano 34"):340,	("20241204 OP-12","Quirófano 34"):2091,	("20241204 OP-159","Quirófano 34"):2497,	("20241204 OP-18","Quirófano 34"):1947,	("20241204 OP-67","Quirófano 34"):117,	("20241204 OP-2","Quirófano 34"):491,	("20241204 OP-138","Quirófano 34"):1746,	("20241204 OP-5","Quirófano 34"):2381,	("20241204 OP-44","Quirófano 34"):837,	("20241204 OP-107","Quirófano 34"):179,	("20241204 OP-88","Quirófano 34"):457,
("20241204 OP-68","Quirófano 35"):715,	("20241204 OP-57","Quirófano 35"):3373,	("20241204 OP-133","Quirófano 35"):211,	("20241204 OP-12","Quirófano 35"):2286,	("20241204 OP-159","Quirófano 35"):3483,	("20241204 OP-18","Quirófano 35"):1175,	("20241204 OP-67","Quirófano 35"):540,	("20241204 OP-2","Quirófano 35"):778,	("20241204 OP-138","Quirófano 35"):941,	("20241204 OP-5","Quirófano 35"):1051,	("20241204 OP-44","Quirófano 35"):290,	("20241204 OP-107","Quirófano 35"):489,	("20241204 OP-88","Quirófano 35"):671,
("20241204 OP-68","Quirófano 36"):192,	("20241204 OP-57","Quirófano 36"):3806,	("20241204 OP-133","Quirófano 36"):784,	("20241204 OP-12","Quirófano 36"):2809,	("20241204 OP-159","Quirófano 36"):2783,	("20241204 OP-18","Quirófano 36"):1842,	("20241204 OP-67","Quirófano 36"):819,	("20241204 OP-2","Quirófano 36"):119,	("20241204 OP-138","Quirófano 36"):528,	("20241204 OP-5","Quirófano 36"):2995,	("20241204 OP-44","Quirófano 36"):351,	("20241204 OP-107","Quirófano 36"):383,	("20241204 OP-88","Quirófano 36"):251,
("20241204 OP-68","Quirófano 37"):135,	("20241204 OP-57","Quirófano 37"):3555,	("20241204 OP-133","Quirófano 37"):853,	("20241204 OP-12","Quirófano 37"):657,	("20241204 OP-159","Quirófano 37"):3571,	("20241204 OP-18","Quirófano 37"):1992,	("20241204 OP-67","Quirófano 37"):273,	("20241204 OP-2","Quirófano 37"):266,	("20241204 OP-138","Quirófano 37"):664,	("20241204 OP-5","Quirófano 37"):2088,	("20241204 OP-44","Quirófano 37"):324,	("20241204 OP-107","Quirófano 37"):828,	("20241204 OP-88","Quirófano 37"):504,
("20241204 OP-68","Quirófano 38"):243,	("20241204 OP-57","Quirófano 38"):3986,	("20241204 OP-133","Quirófano 38"):882,	("20241204 OP-12","Quirófano 38"):2069,	("20241204 OP-159","Quirófano 38"):1012,	("20241204 OP-18","Quirófano 38"):1395,	("20241204 OP-67","Quirófano 38"):710,	("20241204 OP-2","Quirófano 38"):537,	("20241204 OP-138","Quirófano 38"):1525,	("20241204 OP-5","Quirófano 38"):551,	("20241204 OP-44","Quirófano 38"):676,	("20241204 OP-107","Quirófano 38"):1955,	("20241204 OP-88","Quirófano 38"):406,
("20241204 OP-68","Quirófano 39"):599,	("20241204 OP-57","Quirófano 39"):1755,	("20241204 OP-133","Quirófano 39"):304,	("20241204 OP-12","Quirófano 39"):2529,	("20241204 OP-159","Quirófano 39"):2352,	("20241204 OP-18","Quirófano 39"):638,	("20241204 OP-67","Quirófano 39"):256,	("20241204 OP-2","Quirófano 39"):843,	("20241204 OP-138","Quirófano 39"):1561,	("20241204 OP-5","Quirófano 39"):2113,	("20241204 OP-44","Quirófano 39"):700,	("20241204 OP-107","Quirófano 39"):1397,	("20241204 OP-88","Quirófano 39"):109,
("20241204 OP-68","Quirófano 40"):382,	("20241204 OP-57","Quirófano 40"):1574,	("20241204 OP-133","Quirófano 40"):395,	("20241204 OP-12","Quirófano 40"):2907,	("20241204 OP-159","Quirófano 40"):375,	("20241204 OP-18","Quirófano 40"):1930,	("20241204 OP-67","Quirófano 40"):236,	("20241204 OP-2","Quirófano 40"):102,	("20241204 OP-138","Quirófano 40"):180,	("20241204 OP-5","Quirófano 40"):822,	("20241204 OP-44","Quirófano 40"):722,	("20241204 OP-107","Quirófano 40"):530,	("20241204 OP-88","Quirófano 40"):723,
("20241204 OP-68","Quirófano 41"):671,	("20241204 OP-57","Quirófano 41"):3949,	("20241204 OP-133","Quirófano 41"):808,	("20241204 OP-12","Quirófano 41"):729,	("20241204 OP-159","Quirófano 41"):1863,	("20241204 OP-18","Quirófano 41"):1329,	("20241204 OP-67","Quirófano 41"):368,	("20241204 OP-2","Quirófano 41"):355,	("20241204 OP-138","Quirófano 41"):800,	("20241204 OP-5","Quirófano 41"):2829,	("20241204 OP-44","Quirófano 41"):792,	("20241204 OP-107","Quirófano 41"):989,	("20241204 OP-88","Quirófano 41"):521,
("20241204 OP-68","Quirófano 42"):508,	("20241204 OP-57","Quirófano 42"):2709,	("20241204 OP-133","Quirófano 42"):732,	("20241204 OP-12","Quirófano 42"):195,	("20241204 OP-159","Quirófano 42"):1032,	("20241204 OP-18","Quirófano 42"):2469,	("20241204 OP-67","Quirófano 42"):756,	("20241204 OP-2","Quirófano 42"):455,	("20241204 OP-138","Quirófano 42"):1321,	("20241204 OP-5","Quirófano 42"):474,	("20241204 OP-44","Quirófano 42"):451,	("20241204 OP-107","Quirófano 42"):516,	("20241204 OP-88","Quirófano 42"):182,
("20241204 OP-68","Quirófano 43"):146,	("20241204 OP-57","Quirófano 43"):145,	("20241204 OP-133","Quirófano 43"):441,	("20241204 OP-12","Quirófano 43"):1855,	("20241204 OP-159","Quirófano 43"):1117,	("20241204 OP-18","Quirófano 43"):2409,	("20241204 OP-67","Quirófano 43"):486,	("20241204 OP-2","Quirófano 43"):592,	("20241204 OP-138","Quirófano 43"):1505,	("20241204 OP-5","Quirófano 43"):1084,	("20241204 OP-44","Quirófano 43"):606,	("20241204 OP-107","Quirófano 43"):1416,	("20241204 OP-88","Quirófano 43"):868,
("20241204 OP-68","Quirófano 44"):607,	("20241204 OP-57","Quirófano 44"):2097,	("20241204 OP-133","Quirófano 44"):299,	("20241204 OP-12","Quirófano 44"):2610,	("20241204 OP-159","Quirófano 44"):3694,	("20241204 OP-18","Quirófano 44"):794,	("20241204 OP-67","Quirófano 44"):712,	("20241204 OP-2","Quirófano 44"):558,	("20241204 OP-138","Quirófano 44"):1149,	("20241204 OP-5","Quirófano 44"):716,	("20241204 OP-44","Quirófano 44"):329,	("20241204 OP-107","Quirófano 44"):1944,	("20241204 OP-88","Quirófano 44"):147,
("20241204 OP-68","Quirófano 45"):616,	("20241204 OP-57","Quirófano 45"):196,	("20241204 OP-133","Quirófano 45"):777,	("20241204 OP-12","Quirófano 45"):2347,	("20241204 OP-159","Quirófano 45"):828,	("20241204 OP-18","Quirófano 45"):2336,	("20241204 OP-67","Quirófano 45"):759,	("20241204 OP-2","Quirófano 45"):222,	("20241204 OP-138","Quirófano 45"):675,	("20241204 OP-5","Quirófano 45"):2826,	("20241204 OP-44","Quirófano 45"):395,	("20241204 OP-107","Quirófano 45"):1640,	("20241204 OP-88","Quirófano 45"):817,
("20241204 OP-68","Quirófano 46"):155,	("20241204 OP-57","Quirófano 46"):2664,	("20241204 OP-133","Quirófano 46"):247,	("20241204 OP-12","Quirófano 46"):289,	("20241204 OP-159","Quirófano 46"):3259,	("20241204 OP-18","Quirófano 46"):1543,	("20241204 OP-67","Quirófano 46"):380,	("20241204 OP-2","Quirófano 46"):167,	("20241204 OP-138","Quirófano 46"):1043,	("20241204 OP-5","Quirófano 46"):302,	("20241204 OP-44","Quirófano 46"):621,	("20241204 OP-107","Quirófano 46"):725,	("20241204 OP-88","Quirófano 46"):507,
("20241204 OP-68","Quirófano 47"):385,	("20241204 OP-57","Quirófano 47"):3630,	("20241204 OP-133","Quirófano 47"):627,	("20241204 OP-12","Quirófano 47"):3704,	("20241204 OP-159","Quirófano 47"):3830,	("20241204 OP-18","Quirófano 47"):459,	("20241204 OP-67","Quirófano 47"):675,	("20241204 OP-2","Quirófano 47"):132,	("20241204 OP-138","Quirófano 47"):1911,	("20241204 OP-5","Quirófano 47"):1994,	("20241204 OP-44","Quirófano 47"):208,	("20241204 OP-107","Quirófano 47"):511,	("20241204 OP-88","Quirófano 47"):820,
("20241204 OP-68","Quirófano 48"):245,	("20241204 OP-57","Quirófano 48"):2825,	("20241204 OP-133","Quirófano 48"):566,	("20241204 OP-12","Quirófano 48"):2381,	("20241204 OP-159","Quirófano 48"):3374,	("20241204 OP-18","Quirófano 48"):2379,	("20241204 OP-67","Quirófano 48"):296,	("20241204 OP-2","Quirófano 48"):169,	("20241204 OP-138","Quirófano 48"):818,	("20241204 OP-5","Quirófano 48"):1824,	("20241204 OP-44","Quirófano 48"):207,	("20241204 OP-107","Quirófano 48"):602,	("20241204 OP-88","Quirófano 48"):230,
("20241204 OP-68","Quirófano 49"):471,	("20241204 OP-57","Quirófano 49"):1392,	("20241204 OP-133","Quirófano 49"):609,	("20241204 OP-12","Quirófano 49"):689,	("20241204 OP-159","Quirófano 49"):2498,	("20241204 OP-18","Quirófano 49"):993,	("20241204 OP-67","Quirófano 49"):471,	("20241204 OP-2","Quirófano 49"):369,	("20241204 OP-138","Quirófano 49"):850,	("20241204 OP-5","Quirófano 49"):559,	("20241204 OP-44","Quirófano 49"):736,	("20241204 OP-107","Quirófano 49"):1816,	("20241204 OP-88","Quirófano 49"):220,
("20241204 OP-68","Quirófano 50"):651,	("20241204 OP-57","Quirófano 50"):3454,	("20241204 OP-133","Quirófano 50"):528,	("20241204 OP-12","Quirófano 50"):2887,	("20241204 OP-159","Quirófano 50"):1742,	("20241204 OP-18","Quirófano 50"):2400,	("20241204 OP-67","Quirófano 50"):474,	("20241204 OP-2","Quirófano 50"):636,	("20241204 OP-138","Quirófano 50"):854,	("20241204 OP-5","Quirófano 50"):1427,	("20241204 OP-44","Quirófano 50"):702,	("20241204 OP-107","Quirófano 50"):118,	("20241204 OP-88","Quirófano 50"):448,
("20241204 OP-68","Quirófano 51"):860,	("20241204 OP-57","Quirófano 51"):952,	("20241204 OP-133","Quirófano 51"):167,	("20241204 OP-12","Quirófano 51"):589,	("20241204 OP-159","Quirófano 51"):1092,	("20241204 OP-18","Quirófano 51"):723,	("20241204 OP-67","Quirófano 51"):803,	("20241204 OP-2","Quirófano 51"):681,	("20241204 OP-138","Quirófano 51"):465,	("20241204 OP-5","Quirófano 51"):553,	("20241204 OP-44","Quirófano 51"):190,	("20241204 OP-107","Quirófano 51"):1302,	("20241204 OP-88","Quirófano 51"):714,
("20241204 OP-68","Quirófano 52"):353,	("20241204 OP-57","Quirófano 52"):1788,	("20241204 OP-133","Quirófano 52"):337,	("20241204 OP-12","Quirófano 52"):1835,	("20241204 OP-159","Quirófano 52"):3986,	("20241204 OP-18","Quirófano 52"):237,	("20241204 OP-67","Quirófano 52"):505,	("20241204 OP-2","Quirófano 52"):684,	("20241204 OP-138","Quirófano 52"):1501,	("20241204 OP-5","Quirófano 52"):1174,	("20241204 OP-44","Quirófano 52"):182,	("20241204 OP-107","Quirófano 52"):353,	("20241204 OP-88","Quirófano 52"):313,
("20241204 OP-68","Quirófano 53"):825,	("20241204 OP-57","Quirófano 53"):3570,	("20241204 OP-133","Quirófano 53"):247,	("20241204 OP-12","Quirófano 53"):3576,	("20241204 OP-159","Quirófano 53"):2309,	("20241204 OP-18","Quirófano 53"):2084,	("20241204 OP-67","Quirófano 53"):555,	("20241204 OP-2","Quirófano 53"):223,	("20241204 OP-138","Quirófano 53"):1015,	("20241204 OP-5","Quirófano 53"):1383,	("20241204 OP-44","Quirófano 53"):244,	("20241204 OP-107","Quirófano 53"):1213,	("20241204 OP-88","Quirófano 53"):853,
("20241204 OP-68","Quirófano 54"):768,	("20241204 OP-57","Quirófano 54"):380,	("20241204 OP-133","Quirófano 54"):198,	("20241204 OP-12","Quirófano 54"):2254,	("20241204 OP-159","Quirófano 54"):2170,	("20241204 OP-18","Quirófano 54"):647,	("20241204 OP-67","Quirófano 54"):117,	("20241204 OP-2","Quirófano 54"):212,	("20241204 OP-138","Quirófano 54"):1956,	("20241204 OP-5","Quirófano 54"):2911,	("20241204 OP-44","Quirófano 54"):423,	("20241204 OP-107","Quirófano 54"):965,	("20241204 OP-88","Quirófano 54"):109,
("20241204 OP-68","Quirófano 55"):723,	("20241204 OP-57","Quirófano 55"):947,	("20241204 OP-133","Quirófano 55"):749,	("20241204 OP-12","Quirófano 55"):1000,	("20241204 OP-159","Quirófano 55"):2342,	("20241204 OP-18","Quirófano 55"):625,	("20241204 OP-67","Quirófano 55"):315,	("20241204 OP-2","Quirófano 55"):647,	("20241204 OP-138","Quirófano 55"):316,	("20241204 OP-5","Quirófano 55"):1873,	("20241204 OP-44","Quirófano 55"):522,	("20241204 OP-107","Quirófano 55"):1957,	("20241204 OP-88","Quirófano 55"):822,
("20241204 OP-68","Quirófano 56"):885,	("20241204 OP-57","Quirófano 56"):2151,	("20241204 OP-133","Quirófano 56"):869,	("20241204 OP-12","Quirófano 56"):1891,	("20241204 OP-159","Quirófano 56"):344,	("20241204 OP-18","Quirófano 56"):304,	("20241204 OP-67","Quirófano 56"):696,	("20241204 OP-2","Quirófano 56"):506,	("20241204 OP-138","Quirófano 56"):954,	("20241204 OP-5","Quirófano 56"):1656,	("20241204 OP-44","Quirófano 56"):166,	("20241204 OP-107","Quirófano 56"):941,	("20241204 OP-88","Quirófano 56"):779,
("20241204 OP-68","Quirófano 57"):238,	("20241204 OP-57","Quirófano 57"):2231,	("20241204 OP-133","Quirófano 57"):577,	("20241204 OP-12","Quirófano 57"):1297,	("20241204 OP-159","Quirófano 57"):2796,	("20241204 OP-18","Quirófano 57"):2009,	("20241204 OP-67","Quirófano 57"):619,	("20241204 OP-2","Quirófano 57"):199,	("20241204 OP-138","Quirófano 57"):156,	("20241204 OP-5","Quirófano 57"):2706,	("20241204 OP-44","Quirófano 57"):448,	("20241204 OP-107","Quirófano 57"):1212,	("20241204 OP-88","Quirófano 57"):673,
("20241204 OP-68","Quirófano 58"):219,	("20241204 OP-57","Quirófano 58"):3014,	("20241204 OP-133","Quirófano 58"):623,	("20241204 OP-12","Quirófano 58"):1463,	("20241204 OP-159","Quirófano 58"):3464,	("20241204 OP-18","Quirófano 58"):1408,	("20241204 OP-67","Quirófano 58"):103,	("20241204 OP-2","Quirófano 58"):686,	("20241204 OP-138","Quirófano 58"):1974,	("20241204 OP-5","Quirófano 58"):1276,	("20241204 OP-44","Quirófano 58"):231,	("20241204 OP-107","Quirófano 58"):1676,	("20241204 OP-88","Quirófano 58"):817,
("20241204 OP-68","Quirófano 59"):447,	("20241204 OP-57","Quirófano 59"):3769,	("20241204 OP-133","Quirófano 59"):591,	("20241204 OP-12","Quirófano 59"):383,	("20241204 OP-159","Quirófano 59"):2937,	("20241204 OP-18","Quirófano 59"):123,	("20241204 OP-67","Quirófano 59"):565,	("20241204 OP-2","Quirófano 59"):625,	("20241204 OP-138","Quirófano 59"):266,	("20241204 OP-5","Quirófano 59"):1639,	("20241204 OP-44","Quirófano 59"):805,	("20241204 OP-107","Quirófano 59"):1027,	("20241204 OP-88","Quirófano 59"):158,
("20241204 OP-68","Quirófano 60"):801,	("20241204 OP-57","Quirófano 60"):955,	("20241204 OP-133","Quirófano 60"):231,	("20241204 OP-12","Quirófano 60"):3703,	("20241204 OP-159","Quirófano 60"):917,	("20241204 OP-18","Quirófano 60"):569,	("20241204 OP-67","Quirófano 60"):217,	("20241204 OP-2","Quirófano 60"):530,	("20241204 OP-138","Quirófano 60"):1148,	("20241204 OP-5","Quirófano 60"):2679,	("20241204 OP-44","Quirófano 60"):788,	("20241204 OP-107","Quirófano 60"):1257,	("20241204 OP-88","Quirófano 60"):470,
("20241204 OP-68","Quirófano 61"):423,	("20241204 OP-57","Quirófano 61"):3376,	("20241204 OP-133","Quirófano 61"):783,	("20241204 OP-12","Quirófano 61"):2804,	("20241204 OP-159","Quirófano 61"):114,	("20241204 OP-18","Quirófano 61"):2268,	("20241204 OP-67","Quirófano 61"):837,	("20241204 OP-2","Quirófano 61"):474,	("20241204 OP-138","Quirófano 61"):1241,	("20241204 OP-5","Quirófano 61"):1355,	("20241204 OP-44","Quirófano 61"):486,	("20241204 OP-107","Quirófano 61"):438,	("20241204 OP-88","Quirófano 61"):659,
("20241204 OP-68","Quirófano 62"):471,	("20241204 OP-57","Quirófano 62"):3677,	("20241204 OP-133","Quirófano 62"):135,	("20241204 OP-12","Quirófano 62"):2648,	("20241204 OP-159","Quirófano 62"):2655,	("20241204 OP-18","Quirófano 62"):2136,	("20241204 OP-67","Quirófano 62"):881,	("20241204 OP-2","Quirófano 62"):723,	("20241204 OP-138","Quirófano 62"):1753,	("20241204 OP-5","Quirófano 62"):718,	("20241204 OP-44","Quirófano 62"):362,	("20241204 OP-107","Quirófano 62"):1525,	("20241204 OP-88","Quirófano 62"):266,
("20241204 OP-68","Quirófano 63"):375,	("20241204 OP-57","Quirófano 63"):547,	("20241204 OP-133","Quirófano 63"):817,	("20241204 OP-12","Quirófano 63"):2254,	("20241204 OP-159","Quirófano 63"):1835,	("20241204 OP-18","Quirófano 63"):407,	("20241204 OP-67","Quirófano 63"):135,	("20241204 OP-2","Quirófano 63"):744,	("20241204 OP-138","Quirófano 63"):1182,	("20241204 OP-5","Quirófano 63"):2735,	("20241204 OP-44","Quirófano 63"):709,	("20241204 OP-107","Quirófano 63"):434,	("20241204 OP-88","Quirófano 63"):881,
("20241204 OP-68","Quirófano 64"):399,	("20241204 OP-57","Quirófano 64"):2913,	("20241204 OP-133","Quirófano 64"):339,	("20241204 OP-12","Quirófano 64"):1980,	("20241204 OP-159","Quirófano 64"):1618,	("20241204 OP-18","Quirófano 64"):646,	("20241204 OP-67","Quirófano 64"):413,	("20241204 OP-2","Quirófano 64"):283,	("20241204 OP-138","Quirófano 64"):752,	("20241204 OP-5","Quirófano 64"):1332,	("20241204 OP-44","Quirófano 64"):207,	("20241204 OP-107","Quirófano 64"):1785,	("20241204 OP-88","Quirófano 64"):300,
("20241204 OP-68","Quirófano 65"):264,	("20241204 OP-57","Quirófano 65"):2407,	("20241204 OP-133","Quirófano 65"):709,	("20241204 OP-12","Quirófano 65"):2462,	("20241204 OP-159","Quirófano 65"):757,	("20241204 OP-18","Quirófano 65"):118,	("20241204 OP-67","Quirófano 65"):614,	("20241204 OP-2","Quirófano 65"):468,	("20241204 OP-138","Quirófano 65"):1602,	("20241204 OP-5","Quirófano 65"):1805,	("20241204 OP-44","Quirófano 65"):585,	("20241204 OP-107","Quirófano 65"):683,	("20241204 OP-88","Quirófano 65"):394,
("20241204 OP-68","Quirófano 66"):727,	("20241204 OP-57","Quirófano 66"):3460,	("20241204 OP-133","Quirófano 66"):460,	("20241204 OP-12","Quirófano 66"):2844,	("20241204 OP-159","Quirófano 66"):282,	("20241204 OP-18","Quirófano 66"):696,	("20241204 OP-67","Quirófano 66"):552,	("20241204 OP-2","Quirófano 66"):813,	("20241204 OP-138","Quirófano 66"):227,	("20241204 OP-5","Quirófano 66"):2741,	("20241204 OP-44","Quirófano 66"):720,	("20241204 OP-107","Quirófano 66"):1829,	("20241204 OP-88","Quirófano 66"):470,
("20241204 OP-68","Quirófano 67"):484,	("20241204 OP-57","Quirófano 67"):1008,	("20241204 OP-133","Quirófano 67"):823,	("20241204 OP-12","Quirófano 67"):3526,	("20241204 OP-159","Quirófano 67"):1357,	("20241204 OP-18","Quirófano 67"):1214,	("20241204 OP-67","Quirófano 67"):730,	("20241204 OP-2","Quirófano 67"):161,	("20241204 OP-138","Quirófano 67"):771,	("20241204 OP-5","Quirófano 67"):2398,	("20241204 OP-44","Quirófano 67"):777,	("20241204 OP-107","Quirófano 67"):545,	("20241204 OP-88","Quirófano 67"):526,
("20241204 OP-68","Quirófano 68"):827,	("20241204 OP-57","Quirófano 68"):3578,	("20241204 OP-133","Quirófano 68"):220,	("20241204 OP-12","Quirófano 68"):3306,	("20241204 OP-159","Quirófano 68"):2852,	("20241204 OP-18","Quirófano 68"):2153,	("20241204 OP-67","Quirófano 68"):385,	("20241204 OP-2","Quirófano 68"):828,	("20241204 OP-138","Quirófano 68"):1244,	("20241204 OP-5","Quirófano 68"):2560,	("20241204 OP-44","Quirófano 68"):602,	("20241204 OP-107","Quirófano 68"):1039,	("20241204 OP-88","Quirófano 68"):195,
("20241204 OP-68","Quirófano 69"):479,	("20241204 OP-57","Quirófano 69"):2176,	("20241204 OP-133","Quirófano 69"):775,	("20241204 OP-12","Quirófano 69"):1577,	("20241204 OP-159","Quirófano 69"):1304,	("20241204 OP-18","Quirófano 69"):370,	("20241204 OP-67","Quirófano 69"):473,	("20241204 OP-2","Quirófano 69"):513,	("20241204 OP-138","Quirófano 69"):938,	("20241204 OP-5","Quirófano 69"):2513,	("20241204 OP-44","Quirófano 69"):276,	("20241204 OP-107","Quirófano 69"):1850,	("20241204 OP-88","Quirófano 69"):694,
("20241204 OP-68","Quirófano 70"):689,	("20241204 OP-57","Quirófano 70"):496,	("20241204 OP-133","Quirófano 70"):378,	("20241204 OP-12","Quirófano 70"):2749,	("20241204 OP-159","Quirófano 70"):925,	("20241204 OP-18","Quirófano 70"):615,	("20241204 OP-67","Quirófano 70"):253,	("20241204 OP-2","Quirófano 70"):807,	("20241204 OP-138","Quirófano 70"):1576,	("20241204 OP-5","Quirófano 70"):303,	("20241204 OP-44","Quirófano 70"):104,	("20241204 OP-107","Quirófano 70"):1781,	("20241204 OP-88","Quirófano 70"):847,
("20241204 OP-68","Quirófano 71"):335,	("20241204 OP-57","Quirófano 71"):951,	("20241204 OP-133","Quirófano 71"):752,	("20241204 OP-12","Quirófano 71"):505,	("20241204 OP-159","Quirófano 71"):2112,	("20241204 OP-18","Quirófano 71"):1182,	("20241204 OP-67","Quirófano 71"):751,	("20241204 OP-2","Quirófano 71"):875,	("20241204 OP-138","Quirófano 71"):809,	("20241204 OP-5","Quirófano 71"):842,	("20241204 OP-44","Quirófano 71"):533,	("20241204 OP-107","Quirófano 71"):379,	("20241204 OP-88","Quirófano 71"):106,
("20241204 OP-68","Quirófano 72"):231,	("20241204 OP-57","Quirófano 72"):3663,	("20241204 OP-133","Quirófano 72"):563,	("20241204 OP-12","Quirófano 72"):2956,	("20241204 OP-159","Quirófano 72"):2061,	("20241204 OP-18","Quirófano 72"):1172,	("20241204 OP-67","Quirófano 72"):515,	("20241204 OP-2","Quirófano 72"):814,	("20241204 OP-138","Quirófano 72"):1915,	("20241204 OP-5","Quirófano 72"):2423,	("20241204 OP-44","Quirófano 72"):578,	("20241204 OP-107","Quirófano 72"):248,	("20241204 OP-88","Quirófano 72"):128,
("20241204 OP-68","Quirófano 73"):265,	("20241204 OP-57","Quirófano 73"):3289,	("20241204 OP-133","Quirófano 73"):188,	("20241204 OP-12","Quirófano 73"):3174,	("20241204 OP-159","Quirófano 73"):3933,	("20241204 OP-18","Quirófano 73"):1333,	("20241204 OP-67","Quirófano 73"):583,	("20241204 OP-2","Quirófano 73"):570,	("20241204 OP-138","Quirófano 73"):1409,	("20241204 OP-5","Quirófano 73"):2009,	("20241204 OP-44","Quirófano 73"):691,	("20241204 OP-107","Quirófano 73"):1119,	("20241204 OP-88","Quirófano 73"):585,
("20241204 OP-68","Quirófano 74"):849,	("20241204 OP-57","Quirófano 74"):2040,	("20241204 OP-133","Quirófano 74"):269,	("20241204 OP-12","Quirófano 74"):1812,	("20241204 OP-159","Quirófano 74"):1822,	("20241204 OP-18","Quirófano 74"):1088,	("20241204 OP-67","Quirófano 74"):787,	("20241204 OP-2","Quirófano 74"):397,	("20241204 OP-138","Quirófano 74"):1062,	("20241204 OP-5","Quirófano 74"):2705,	("20241204 OP-44","Quirófano 74"):790,	("20241204 OP-107","Quirófano 74"):306,	("20241204 OP-88","Quirófano 74"):831,
("20241204 OP-68","Quirófano 75"):490,	("20241204 OP-57","Quirófano 75"):2776,	("20241204 OP-133","Quirófano 75"):388,	("20241204 OP-12","Quirófano 75"):738,	("20241204 OP-159","Quirófano 75"):2582,	("20241204 OP-18","Quirófano 75"):2053,	("20241204 OP-67","Quirófano 75"):268,	("20241204 OP-2","Quirófano 75"):331,	("20241204 OP-138","Quirófano 75"):826,	("20241204 OP-5","Quirófano 75"):438,	("20241204 OP-44","Quirófano 75"):313,	("20241204 OP-107","Quirófano 75"):555,	("20241204 OP-88","Quirófano 75"):596,
("20241204 OP-68","Quirófano 76"):388,	("20241204 OP-57","Quirófano 76"):3178,	("20241204 OP-133","Quirófano 76"):685,	("20241204 OP-12","Quirófano 76"):1113,	("20241204 OP-159","Quirófano 76"):3226,	("20241204 OP-18","Quirófano 76"):1392,	("20241204 OP-67","Quirófano 76"):820,	("20241204 OP-2","Quirófano 76"):122,	("20241204 OP-138","Quirófano 76"):338,	("20241204 OP-5","Quirófano 76"):2302,	("20241204 OP-44","Quirófano 76"):463,	("20241204 OP-107","Quirófano 76"):388,	("20241204 OP-88","Quirófano 76"):432,
("20241204 OP-68","Quirófano 77"):694,	("20241204 OP-57","Quirófano 77"):1744,	("20241204 OP-133","Quirófano 77"):449,	("20241204 OP-12","Quirófano 77"):1864,	("20241204 OP-159","Quirófano 77"):1521,	("20241204 OP-18","Quirófano 77"):970,	("20241204 OP-67","Quirófano 77"):715,	("20241204 OP-2","Quirófano 77"):205,	("20241204 OP-138","Quirófano 77"):230,	("20241204 OP-5","Quirófano 77"):1080,	("20241204 OP-44","Quirófano 77"):348,	("20241204 OP-107","Quirófano 77"):1892,	("20241204 OP-88","Quirófano 77"):732,
("20241204 OP-68","Quirófano 78"):391,	("20241204 OP-57","Quirófano 78"):2880,	("20241204 OP-133","Quirófano 78"):574,	("20241204 OP-12","Quirófano 78"):1404,	("20241204 OP-159","Quirófano 78"):2824,	("20241204 OP-18","Quirófano 78"):920,	("20241204 OP-67","Quirófano 78"):786,	("20241204 OP-2","Quirófano 78"):675,	("20241204 OP-138","Quirófano 78"):1149,	("20241204 OP-5","Quirófano 78"):204,	("20241204 OP-44","Quirófano 78"):245,	("20241204 OP-107","Quirófano 78"):1943,	("20241204 OP-88","Quirófano 78"):715,
("20241204 OP-68","Quirófano 79"):164,	("20241204 OP-57","Quirófano 79"):586,	("20241204 OP-133","Quirófano 79"):616,	("20241204 OP-12","Quirófano 79"):2126,	("20241204 OP-159","Quirófano 79"):2749,	("20241204 OP-18","Quirófano 79"):2205,	("20241204 OP-67","Quirófano 79"):379,	("20241204 OP-2","Quirófano 79"):526,	("20241204 OP-138","Quirófano 79"):598,	("20241204 OP-5","Quirófano 79"):1266,	("20241204 OP-44","Quirófano 79"):215,	("20241204 OP-107","Quirófano 79"):133,	("20241204 OP-88","Quirófano 79"):130,
("20241204 OP-68","Quirófano 80"):409,	("20241204 OP-57","Quirófano 80"):846,	("20241204 OP-133","Quirófano 80"):517,	("20241204 OP-12","Quirófano 80"):1263,	("20241204 OP-159","Quirófano 80"):1106,	("20241204 OP-18","Quirófano 80"):1389,	("20241204 OP-67","Quirófano 80"):747,	("20241204 OP-2","Quirófano 80"):881,	("20241204 OP-138","Quirófano 80"):1091,	("20241204 OP-5","Quirófano 80"):624,	("20241204 OP-44","Quirófano 80"):146,	("20241204 OP-107","Quirófano 80"):1616,	("20241204 OP-88","Quirófano 80"):832,
("20241204 OP-68","Quirófano 81"):147,	("20241204 OP-57","Quirófano 81"):761,	("20241204 OP-133","Quirófano 81"):587,	("20241204 OP-12","Quirófano 81"):2150,	("20241204 OP-159","Quirófano 81"):483,	("20241204 OP-18","Quirófano 81"):2261,	("20241204 OP-67","Quirófano 81"):176,	("20241204 OP-2","Quirófano 81"):782,	("20241204 OP-138","Quirófano 81"):436,	("20241204 OP-5","Quirófano 81"):438,	("20241204 OP-44","Quirófano 81"):226,	("20241204 OP-107","Quirófano 81"):1548,	("20241204 OP-88","Quirófano 81"):487,
("20241204 OP-68","Quirófano 82"):828,	("20241204 OP-57","Quirófano 82"):3454,	("20241204 OP-133","Quirófano 82"):151,	("20241204 OP-12","Quirófano 82"):1599,	("20241204 OP-159","Quirófano 82"):2747,	("20241204 OP-18","Quirófano 82"):679,	("20241204 OP-67","Quirófano 82"):291,	("20241204 OP-2","Quirófano 82"):764,	("20241204 OP-138","Quirófano 82"):972,	("20241204 OP-5","Quirófano 82"):490,	("20241204 OP-44","Quirófano 82"):433,	("20241204 OP-107","Quirófano 82"):179,	("20241204 OP-88","Quirófano 82"):477,
("20241204 OP-68","Quirófano 83"):348,	("20241204 OP-57","Quirófano 83"):1014,	("20241204 OP-133","Quirófano 83"):207,	("20241204 OP-12","Quirófano 83"):2209,	("20241204 OP-159","Quirófano 83"):3463,	("20241204 OP-18","Quirófano 83"):585,	("20241204 OP-67","Quirófano 83"):650,	("20241204 OP-2","Quirófano 83"):185,	("20241204 OP-138","Quirófano 83"):521,	("20241204 OP-5","Quirófano 83"):2441,	("20241204 OP-44","Quirófano 83"):862,	("20241204 OP-107","Quirófano 83"):149,	("20241204 OP-88","Quirófano 83"):525,
("20241204 OP-68","Quirófano 84"):856,	("20241204 OP-57","Quirófano 84"):958,	("20241204 OP-133","Quirófano 84"):777,	("20241204 OP-12","Quirófano 84"):3671,	("20241204 OP-159","Quirófano 84"):1132,	("20241204 OP-18","Quirófano 84"):804,	("20241204 OP-67","Quirófano 84"):324,	("20241204 OP-2","Quirófano 84"):257,	("20241204 OP-138","Quirófano 84"):171,	("20241204 OP-5","Quirófano 84"):1082,	("20241204 OP-44","Quirófano 84"):386,	("20241204 OP-107","Quirófano 84"):641,	("20241204 OP-88","Quirófano 84"):500,
("20241204 OP-68","Quirófano 85"):324,	("20241204 OP-57","Quirófano 85"):2736,	("20241204 OP-133","Quirófano 85"):212,	("20241204 OP-12","Quirófano 85"):1100,	("20241204 OP-159","Quirófano 85"):1349,	("20241204 OP-18","Quirófano 85"):1419,	("20241204 OP-67","Quirófano 85"):707,	("20241204 OP-2","Quirófano 85"):814,	("20241204 OP-138","Quirófano 85"):348,	("20241204 OP-5","Quirófano 85"):940,	("20241204 OP-44","Quirófano 85"):196,	("20241204 OP-107","Quirófano 85"):1058,	("20241204 OP-88","Quirófano 85"):756,
("20241204 OP-68","Quirófano 86"):499,	("20241204 OP-57","Quirófano 86"):2363,	("20241204 OP-133","Quirófano 86"):510,	("20241204 OP-12","Quirófano 86"):3712,	("20241204 OP-159","Quirófano 86"):2421,	("20241204 OP-18","Quirófano 86"):708,	("20241204 OP-67","Quirófano 86"):168,	("20241204 OP-2","Quirófano 86"):689,	("20241204 OP-138","Quirófano 86"):267,	("20241204 OP-5","Quirófano 86"):696,	("20241204 OP-44","Quirófano 86"):125,	("20241204 OP-107","Quirófano 86"):779,	("20241204 OP-88","Quirófano 86"):807,
("20241204 OP-68","Quirófano 87"):622,	("20241204 OP-57","Quirófano 87"):590,	("20241204 OP-133","Quirófano 87"):197,	("20241204 OP-12","Quirófano 87"):3683,	("20241204 OP-159","Quirófano 87"):1053,	("20241204 OP-18","Quirófano 87"):557,	("20241204 OP-67","Quirófano 87"):747,	("20241204 OP-2","Quirófano 87"):634,	("20241204 OP-138","Quirófano 87"):972,	("20241204 OP-5","Quirófano 87"):1741,	("20241204 OP-44","Quirófano 87"):841,	("20241204 OP-107","Quirófano 87"):1303,	("20241204 OP-88","Quirófano 87"):678,
("20241204 OP-68","Quirófano 88"):445,	("20241204 OP-57","Quirófano 88"):305,	("20241204 OP-133","Quirófano 88"):388,	("20241204 OP-12","Quirófano 88"):2214,	("20241204 OP-159","Quirófano 88"):679,	("20241204 OP-18","Quirófano 88"):1850,	("20241204 OP-67","Quirófano 88"):400,	("20241204 OP-2","Quirófano 88"):723,	("20241204 OP-138","Quirófano 88"):1717,	("20241204 OP-5","Quirófano 88"):971,	("20241204 OP-44","Quirófano 88"):593,	("20241204 OP-107","Quirófano 88"):597,	("20241204 OP-88","Quirófano 88"):644,
("20241204 OP-68","Quirófano 89"):838,	("20241204 OP-57","Quirófano 89"):2043,	("20241204 OP-133","Quirófano 89"):396,	("20241204 OP-12","Quirófano 89"):311,	("20241204 OP-159","Quirófano 89"):1835,	("20241204 OP-18","Quirófano 89"):2041,	("20241204 OP-67","Quirófano 89"):287,	("20241204 OP-2","Quirófano 89"):776,	("20241204 OP-138","Quirófano 89"):1943,	("20241204 OP-5","Quirófano 89"):1535,	("20241204 OP-44","Quirófano 89"):323,	("20241204 OP-107","Quirófano 89"):1606,	("20241204 OP-88","Quirófano 89"):522,
("20241204 OP-68","Quirófano 90"):244,	("20241204 OP-57","Quirófano 90"):1304,	("20241204 OP-133","Quirófano 90"):468,	("20241204 OP-12","Quirófano 90"):864,	("20241204 OP-159","Quirófano 90"):1047,	("20241204 OP-18","Quirófano 90"):518,	("20241204 OP-67","Quirófano 90"):831,	("20241204 OP-2","Quirófano 90"):114,	("20241204 OP-138","Quirófano 90"):545,	("20241204 OP-5","Quirófano 90"):998,	("20241204 OP-44","Quirófano 90"):562,	("20241204 OP-107","Quirófano 90"):1224,	("20241204 OP-88","Quirófano 90"):379,
("20241204 OP-68","Quirófano 91"):309,	("20241204 OP-57","Quirófano 91"):2740,	("20241204 OP-133","Quirófano 91"):381,	("20241204 OP-12","Quirófano 91"):533,	("20241204 OP-159","Quirófano 91"):1382,	("20241204 OP-18","Quirófano 91"):1328,	("20241204 OP-67","Quirófano 91"):379,	("20241204 OP-2","Quirófano 91"):250,	("20241204 OP-138","Quirófano 91"):1462,	("20241204 OP-5","Quirófano 91"):2310,	("20241204 OP-44","Quirófano 91"):873,	("20241204 OP-107","Quirófano 91"):1267,	("20241204 OP-88","Quirófano 91"):547,
("20241204 OP-68","Quirófano 92"):234,	("20241204 OP-57","Quirófano 92"):2267,	("20241204 OP-133","Quirófano 92"):281,	("20241204 OP-12","Quirófano 92"):1350,	("20241204 OP-159","Quirófano 92"):3075,	("20241204 OP-18","Quirófano 92"):2046,	("20241204 OP-67","Quirófano 92"):528,	("20241204 OP-2","Quirófano 92"):616,	("20241204 OP-138","Quirófano 92"):378,	("20241204 OP-5","Quirófano 92"):2376,	("20241204 OP-44","Quirófano 92"):429,	("20241204 OP-107","Quirófano 92"):698,	("20241204 OP-88","Quirófano 92"):517,
("20241204 OP-68","Quirófano 93"):830,	("20241204 OP-57","Quirófano 93"):1124,	("20241204 OP-133","Quirófano 93"):109,	("20241204 OP-12","Quirófano 93"):3449,	("20241204 OP-159","Quirófano 93"):1363,	("20241204 OP-18","Quirófano 93"):213,	("20241204 OP-67","Quirófano 93"):742,	("20241204 OP-2","Quirófano 93"):126,	("20241204 OP-138","Quirófano 93"):1979,	("20241204 OP-5","Quirófano 93"):1338,	("20241204 OP-44","Quirófano 93"):175,	("20241204 OP-107","Quirófano 93"):1218,	("20241204 OP-88","Quirófano 93"):690,
("20241204 OP-68","Quirófano 94"):412,	("20241204 OP-57","Quirófano 94"):3345,	("20241204 OP-133","Quirófano 94"):711,	("20241204 OP-12","Quirófano 94"):3971,	("20241204 OP-159","Quirófano 94"):2952,	("20241204 OP-18","Quirófano 94"):1319,	("20241204 OP-67","Quirófano 94"):510,	("20241204 OP-2","Quirófano 94"):645,	("20241204 OP-138","Quirófano 94"):760,	("20241204 OP-5","Quirófano 94"):1811,	("20241204 OP-44","Quirófano 94"):547,	("20241204 OP-107","Quirófano 94"):206,	("20241204 OP-88","Quirófano 94"):890,
("20241204 OP-68","Quirófano 95"):841,	("20241204 OP-57","Quirófano 95"):3080,	("20241204 OP-133","Quirófano 95"):720,	("20241204 OP-12","Quirófano 95"):201,	("20241204 OP-159","Quirófano 95"):2519,	("20241204 OP-18","Quirófano 95"):1931,	("20241204 OP-67","Quirófano 95"):418,	("20241204 OP-2","Quirófano 95"):348,	("20241204 OP-138","Quirófano 95"):297,	("20241204 OP-5","Quirófano 95"):2539,	("20241204 OP-44","Quirófano 95"):474,	("20241204 OP-107","Quirófano 95"):1302,	("20241204 OP-88","Quirófano 95"):585,
("20241204 OP-68","Quirófano 96"):412,	("20241204 OP-57","Quirófano 96"):885,	("20241204 OP-133","Quirófano 96"):594,	("20241204 OP-12","Quirófano 96"):1434,	("20241204 OP-159","Quirófano 96"):3482,	("20241204 OP-18","Quirófano 96"):408,	("20241204 OP-67","Quirófano 96"):713,	("20241204 OP-2","Quirófano 96"):851,	("20241204 OP-138","Quirófano 96"):497,	("20241204 OP-5","Quirófano 96"):422,	("20241204 OP-44","Quirófano 96"):170,	("20241204 OP-107","Quirófano 96"):1468,	("20241204 OP-88","Quirófano 96"):312,
("20241204 OP-68","Quirófano 97"):897,	("20241204 OP-57","Quirófano 97"):1788,	("20241204 OP-133","Quirófano 97"):667,	("20241204 OP-12","Quirófano 97"):2050,	("20241204 OP-159","Quirófano 97"):1771,	("20241204 OP-18","Quirófano 97"):1142,	("20241204 OP-67","Quirófano 97"):474,	("20241204 OP-2","Quirófano 97"):685,	("20241204 OP-138","Quirófano 97"):1091,	("20241204 OP-5","Quirófano 97"):2372,	("20241204 OP-44","Quirófano 97"):837,	("20241204 OP-107","Quirófano 97"):831,	("20241204 OP-88","Quirófano 97"):807,
("20241204 OP-68","Quirófano 98"):555,	("20241204 OP-57","Quirófano 98"):2673,	("20241204 OP-133","Quirófano 98"):376,	("20241204 OP-12","Quirófano 98"):993,	("20241204 OP-159","Quirófano 98"):3332,	("20241204 OP-18","Quirófano 98"):1412,	("20241204 OP-67","Quirófano 98"):852,	("20241204 OP-2","Quirófano 98"):530,	("20241204 OP-138","Quirófano 98"):1128,	("20241204 OP-5","Quirófano 98"):2489,	("20241204 OP-44","Quirófano 98"):278,	("20241204 OP-107","Quirófano 98"):1849,	("20241204 OP-88","Quirófano 98"):128,
("20241204 OP-68","Quirófano 99"):561,	("20241204 OP-57","Quirófano 99"):3370,	("20241204 OP-133","Quirófano 99"):576,	("20241204 OP-12","Quirófano 99"):605,	("20241204 OP-159","Quirófano 99"):3627,	("20241204 OP-18","Quirófano 99"):375,	("20241204 OP-67","Quirófano 99"):313,	("20241204 OP-2","Quirófano 99"):341,	("20241204 OP-138","Quirófano 99"):1965,	("20241204 OP-5","Quirófano 99"):2405,	("20241204 OP-44","Quirófano 99"):122,	("20241204 OP-107","Quirófano 99"):374,	("20241204 OP-88","Quirófano 99"):793,
}

# -------------------------------------
# Creación del objeto problema en PuLP
# -------------------------------------
prob = lp.LpProblem("Punto1",lp.LpMinimize)

# -----------------------------
# Variables de Decisión
# -----------------------------
# Variable
x = {(i,j):lp.LpVariable(f"Si operacion {i} en quiro {j} " ,0,1, cat=lp.LpBinary) for i in I for j in J}

# -----------------------------
# Restricciones
# -----------------------------
#1
for i in I:
    prob += lp.lpSum(x[i,j] for j in J) >= 1

#2
for i in I:
    for j in J:
        prob += lp.lpSum(x[h,j] for h in L[i]) + x[i,j] <= 1

# -----------------------------
# Función objetivo
# -----------------------------
prob+=lp.lpSum(x[i,j] *c[i,j] for i in I for j in J)

prob.solve()


# Imprimir estado final del optimizador
print("Status:",lp.LpStatus[prob.status])

# Valor de la función objetivo
print("Funcion objetivo",lp.value(prob.objective))
print()

print("Asignacion de operaciones a quirofanos")
print
#Solucion
for j in J:
    if sum(x[i,j].value() for i in I) > 0:
        print(j)
        for i in I:
            if x[i,j].value() >0:
                print(i)
        print()

